{
  "Title": "Honey Butter Chicken (HermanAtHome)",
  "SourceUrl": "https://hermanathome.com/honey-butter-chicken/",
  "IngredientGroups": [
    {
      "Header": "For the Chicken",
      "Items": [
        "650 g boneless skinless chicken thighs",
        "2 tbsp soy sauce",
        "1 tbsp honey",
        "1 tsp garlic powder",
        "Salt & black pepper"
      ]
    },
    {
      "Header": "Honey Butter Sauce",
      "Items": [
        "60 ml soy sauce",
        "4 garlic cloves, minced",
        "60 ml water",
        "3 tbsp unsalted butter",
        "1 tsp corn starch"
      ]
    }
  ],

  "Instructions": [
    "Marinate the chicken with soy sauce, honey, garlic powder, salt, and black pepper.",
    "Preheat your air fryer to 180°C.",
    "Air fry the chicken for 12–15 minutes, flipping halfway, until mostly cooked and golden.",
    "While the chicken is cooking, mix soy sauce, honey, water, and cornstarch in a bowl.",
    "In a frying pan, melt the butter, the add the minced garlic and cook for 30 seconds.",
    "Pour in the sauce mixture, stir, and let it simmer for 1-2 minutes until thickened.",
    "Add the air‑fried chicken to the pan and toss to coat evenly in the sauce.",
    "Cook together 1–2 minutes so the sauce clings to the chicken.",
    "Serve with rice, veggies, and other sides."
  ],
  "Customizations": [
    "Add a pinch of chilli flakes or cayenne for heat.",
    "Use chicken breast instead of thighs if preferred.",
    "Finish with a squeeze of lemon juice for brightness.",
    "Garnish with chopped parsley or spring onions.",
    "Serve with sautéed green beans, broccoli, or a fresh cucumber salad for extra crunch."
  ],
  "OptionalInstructions": [
    "Steam or blanch broccoli and baby bok choy for 2–3 minutes until tender.",
    "Quickly sauté peppers and mushrooms in a little oil for 2–3 minutes.",
    "Add bean sprouts and chillies raw or toss with cooked veggies.",
    "Sprinkle fresh coriander on top before serving.",
    "Serve cooked vegetables on top of chicken and rice or on the side."
  ]
}
