{
  "Title": "Maple Mustard Chicken Thighs",
  "SourceUrl": "https://royaleeats.com/p/maple-mustard-chicken-thighs",

  "IngredientGroups": [
    {
      "Header": "Chicken",
      "Items": [
        "6 bone-in chicken thighs (approx. 1.4 kg / 3 lb)"
      ]
    },
    {
      "Header": "Marinade",
      "Items": [
        "1 tbsp smoked paprika",
        "1 tbsp Italian seasoning",
        "3 tsp kosher salt",
        "3 tsp black pepper",
        "3 tsp garlic powder",
        "1 tsp cumin",
        "½ tsp ground cayenne pepper",
        "¼ cup olive oil"
      ]
    },
    {
      "Header": "Maple Mustard Glaze",
      "Items": [
        "¾ cup (180 ml) pure maple syrup",
        "¾ cup (150 g) light brown sugar, packed",
        "½ cup (120 ml) Worcestershire sauce",
        "3 tbsp Dijon mustard",
        "¼ tsp allspice"
      ]
    }
  ],

  "Instructions": [
    "Clean and pat dry the chicken thighs.",
    "In a large bowl, mix together olive oil, salt, black pepper, garlic powder, cumin, smoked paprika, cayenne pepper, and Italian seasoning.",
    "Coat the chicken thighs thoroughly with the marinade, making sure to rub some underneath the skin. Cover and refrigerate for at least 2 hours, or up to 24 hours.",
    "Preheat the oven to 220°C (425°F).",
    "Prepare the glaze by whisking together maple syrup, Dijon mustard, Worcestershire sauce, brown sugar, and allspice in a pan over medium-low heat. Simmer gently for 3–5 minutes until slightly thickened, then remove from heat and allow to cool.",
    "Line a baking tray with foil and place an oven-safe rack on top. Lightly spray the rack with non-stick oil.",
    "Place the chicken thighs skin-side up on the rack and bake uncovered for 30 minutes.",
    "Flip the thighs and bake for another 25–30 minutes.",
    "Brush the chicken generously with glaze and bake skin-side up for a final 5–10 minutes until caramelised.",
    "Rest for 5 minutes before serving."
  ],

  "OptionalInstructions": [
    "Air Fryer Method: Preheat air fryer to 190°C. Arrange marinated chicken thighs skin-side up in a single layer. Air fry for 18–22 minutes, turning halfway, until cooked through.",
    "Brush the chicken with glaze and return to the air fryer for an additional 3–5 minutes until sticky and caramelised."
  ],

  "ServingSuggestions": [
    "Serve with steamed jasmine rice or buttery mashed potatoes.",
    "Pair with roasted vegetables such as carrots, broccoli, or green beans.",
    "Add a fresh side salad with lemon vinaigrette to balance the sweetness.",
    "Garnish with fresh parsley or spring onions before serving."
  ]
}
